clc
clear
% 1. 加载数据
x = [0.9 1.3 1.9 2.1 2.6 3.0 3.9 4.4 4.7 5.0 6.0 7.0 8.0 9.2 10.5 11.3 11.6 12.0 12.6 13.0 13.3];
y = [1.3 1.5 1.85 2.1 2.6 2.7 2.4 2.15 2.05 2.1 2.25 2.3 2.25 1.95 1.4 0.9 0.7 0.6 0.5 0.4 0.25];
% 2. 绘制散点图
plot(x, y, 'r*', 'MarkerSize', 5); 
% 3. 拟合
A = polyfit(x,y,3) %10次曲线拟合的更好
z = polyval(A,x);
plot(x,y,'k+',x,z,'r')%作出数据点和拟合曲线的图形
fprintf('f(x) = %f x^3 - %f x^2 + %f x + %f \n',A(1),-A(2),A(3),A(4));
% 4. 插值
i = 0.9:0.1:13.3;
s = interp1(x, y, i, 'spline');
figure, plot(x, y, '+', i, s, x, y, 'r:');     %作图
% 5. 求解函数
length(x) - 1 %求三次多项式个数
B = spline(x,y).coefs %在每个小区间[ xj,xj+1 ]上是三次多项式